{
  "profesional": "I am",
  "programmer": "Programmer",
  "freelancer": "Freelancer",
  "se": "Software Engineer",
  "theme_dark": "Dark",
  "theme_light": "Light",
  "home": "Home",
  "about": "About",
  "portfolio": "Portfolio",
  "resume": "Resume",
  "blog": "Notes",
  "services": "Services",
  "contact": "Contact",
  "about_desc": "I am a Software Engineer dedicated to building efficient, scalable, and user-friendly digital solutions. With a strong background in web development, I am used to working with various modern technologies such as JavaScript/TypeScript, Svelte, Rust, and various other frameworks.",
  "about_age": "I am still young and still like to seek new experiences, of course in the field of technology.",
  "born": "Birth Day",
  "age": "Age",
  "website": "Website",
  "phone": "Phone",
  "city": "City",
  "degree": "Degree",
  "bachelor": "Bachelor",
  "freelance": "Freelance",
  "availability": "Available",
  "birth_date": "June 9, 2000",
  "happy_client": "Happy Clients",
  "project_completed": "Projects Completed",
  "support": "Hours Of Support",
  "hard_worker": "Hard Workers",
  "skill_title": "Skills",
  "skill_desc": "My journey in the world of technology began with curiosity about how an application works. From there, I started to learn on my own, build small projects, and continue to grow until I become a Software Engineer who is used to working from the frontend to the backend.",
  "rust_desc": "Rust is a programming language that I have learned since my 6th semester of college. Initially I studied python for AI, then I got information 'They say Rust can also be used for AI...', since then I have been interested even though it is true that rust is the most annoying programming language because it borrows its check. However, Rust remains my favorite programming language until now and is more focused on developing backend applications and web apis for now.",
  "python_desc": "Before knowing Rust, Python was the first programming language I learned. I got to know Python when I joined the MSIB Kampus Merdeka program at Orbit Future Academy and here I also first got to know the world of IT and Technology. I first used Python to build AI, ML, DL, etc. However, after I worked, I never used Python because at my workplace I used another programming language.",
  "html_desc": "I first learned HTML when I joined the MSIB Kampus Merdeka program at Orbit Future Academy, I used HTML as templating for implementing web-based AI models with Flask. In addition to templating, I also used HTML to create my own portfolio website before, for version 1 as in the following url.",
  "css_desc": "Learning HTML feels incomplete without CSS, because the website also needs a good appearance and is pleasant to look at, because I want to present a website that people will feel at home when they visit. Although I myself am still lacking in using styling with CSS.",
  "js_desc": "At first I didn't want to learn Javascript because my teacher once advised me to choose one programming language first to learn in depth, after you can then you are free to learn anything. So I decided to learn the basics of Rust first. But when I felt it was enough, I started to learn Javascript little by little so I could make website pages more interactive with DOM.",
  "ts_desc": "Once I got a personal project using MERN tech stack (MongoDB, Express, React, NodeJS), I decided to learn TypeScript to be able to create more efficient and effective applications. In addition, with typescript I can determine the appropriate data type so that the data sent between the frontend and backend does not occur errors and for adjustments with ORM prisma is also easy to debug.",
  "cs_desc": "During the 6th semester break, I decided to look for a job so that I could continue my studies. Finally, at the beginning of the 7th semester, precisely in November 2022, I was accepted at PT S21 Micropiranti Computer. In the company, I got acquainted with the programming languages ​​C#, .NET, and .NET Core. C# is used to create backend applications and web apis in the company. However, I only use C# for projects in the office, for the programming language that I use and continue to study is Rust.",

  "actix_desc": "Previously when I wanted to create a web api with rust I created it using tokio. Because with tokio I can create a web api with asynchronous, or multi thread. Then I got to know actix web, with actix web creating web api becomes easier because there are features that I can use such as middleware, routing, error handling, etc. so that creating backend applications or web api becomes easier and faster.",
  "vite_desc": "Who doesn't know Vite, Vite is a fast and easy-to-use module bundler. With Vite we are provided with example sources, frameworks, js/ts configurations, and support for modern frontend frameworks such as React, Vue, Svelte, etc. In addition, Vite also has unitesting and hot module reloading, making frontend application development easier.",
  "svelte_desc": "In addition to the framework for creating backend applications, I also create website pages with frontend frameworks such as Svelte or SvelteKit. The reason why I use svelte is because it is simple, fast, easy and has a small bundle size because it does not require a Virtual DOM or WebAssembly runtime. In addition, svelte also uses Two Way Binding so there is no need to manipulate the DOM manually.",
  "express_desc": "For the most popular and easy NodeJS Framework is Express. In addition, extensive community support also gives us support when creating backend applications or web api with Express and Express also has a lot of middleware that we can use such as body parser, cors, morgan, friendly routing, error handling, etc. So that making backend applications or web api becomes easier and faster.",
  "hono_desc": "There is express in NodeJS and Hono in Bun. The Bun framework that I like the most and in my personal opinion is easy to use is hono. Like express, hono also has the same many and complete features as express, so when you want to migrate from express to hono it doesn't require a lot of effort. However, for Hono and Bun itself, I haven't used it for long and am still learning the new features of Hono and Bun.",
  "react_desc": "Before svelte, react and next were my previous favorite frontend frameworks. I initially used react because when I wanted to manipulate state and DOM with Vanilla Javascript it was something that required more effort and at that time react was a popular framework with a very large community. Whatever you want to find, it must be there. However, after react V18 appeared and above, I started to dislike react because the presence of hooks and the increasing number of third-party libraries made me personally confused. React is now not as simple as it used to be and since then I started using svelte.",
  "bootstrap_desc": "In addition to the framework for interactive frontend I also use bootstrap to make website designs more responsive and make it easier to style website pages. I started using bootstrap when I first used react. Because with bootstrap I can create a component with the class and attributes provided by bootstrap, so that my component can change according to the appearance I want.",
  "sass_desc": "For Sass, I can say that I haven't used it for long, because I used Sass when Bootstrap version 5.3.0 was released on May 30, 2023. At that time I used Bootstrap because there was a need for a project that was widely used by clients and could change its style. So I combined Sass with Bootstrap to automate several components so that I no longer had to create them manually.",
  "dotnet_desc": "Looking for an environment for windows-based applications, .NET is the right choice as a framework for web api, mvc, desktop, etc. .NET and C# are the technologies that I use and in the office where I work. In the office I use C# and .NET Core to create backend applications and web api. However, for personal projects or everyday programming languages ​​outside the office I still use Rust.",
  "angular_desc": "Angular JS or Angular version 1 is a framework used by the team in the office as the main frontend framework. Which is usually combined with JQuery and Gulp as its module bundler. Angular JS has ended its official support by the Angular team since January 2022. Therefore, I am gradually migrating technology to Svelte because the team's habits with angular js using two-way data binding and svelte are simpler and easier. In addition, the superiors and team are also set up to use svelte.",
  
  "git_desc": "For all programmers, CI/CD is a tool to integrate software, code or project so that the development cycle can be maintained properly. When I started my adventure in the world of technology, I started using git as the main social media for a programmer. Where I can save and publish what I have created on the internet. In addition, I also studied and implemented Gitea in the company I work for. Because so that the project code can be managed properly and efficiently.",
  "swagger_desc": "A programmer, more precisely a backend or fullstack, must certainly create documentation of the API that has been created. In addition, this documentation is also very helpful in facilitating learning integration into several other applications by implementing the API specification that has been created. So that if working as a team with frontend, mobile, desktop and other backend applications will be easier and more structured. In addition, the API specification also helps me personally in remembering the features and functions of the applications I create.",
  "postgresql_desc": "Creating a backend or API application certainly does not miss the name of the database. PostgreSQL is one of my favorite databases because it has very complete features and of course it's free. PostgreSQL is the first database I learned and I use to create personal projects. The features that I like and use most often in PostgreSQl are functions and Stored Procedures, because with this feature the code writing is not too long and neat besides the business logic is also in the database.",
  "mssql_desc": "In addition to PostgreSQL in the office and my personal projects I also use Microsoft SQL Server. I first learned SQL Server when I entered the company I work for, the features of SQL Server are no less numerous than PostgreSQL. However, to access all the features of SQL Server natively, you can only use C# and .NET or .NET Core such as Trigger, Migration, Tracking, SMO, Dependency Injection, etc., ORM with Entity Framework and Notification. However, functions and stored procedures can still be used with other programming languages ​​such as Rust which I use.",
  "nodejs_desc": "The beginning of my learning nodejs was because when I wanted to use React I needed NPM (Node Package Manager) to install dependencies and other packages. So I started to learn a little bit about nodejs so that at least I knew how Javascript worked on the server side. But as time went by, it turned out that I also needed more understanding to build backend applications with nodejs. I started learning Express.js and Prisma to create more efficient and effective backend applications.",
  "bun_desc": "Bun or what people know as the fastest alternative to Node JS. Bun has new features such as module bundler, routing, database, and so on. In addition, bun also has features that make backend applications faster and more efficient. However, I haven't been using bun for long and am still learning the new features of bun. So there is still a lot to learn. However, little by little I am migrating from nodejs to bun so that the backend application created with javascript/typescript is expected to be faster.",
  "mongodb_desc": "Another database that I use is MongoDB. MongoDB is a non-relational database that is very popular with many developers. The features that I like the most in MongoDB are Full Text Search, Aggregation, and Replication. This feature is very helpful in improving application performance in data search or get data. Although other databases such as PostgreSQL and Microsoft SQL Server also have this feature, MongoDB has better and faster performance because it is based on object databases.",
  "redis_desc": "Another database that I use is Redis. As we know, Redis is used to store status data as a cache on the server such as session data or other data that is often accessed by users. Because Redis is key-value based and stored in memory, it is very fast and efficient. However, I haven't been using Redis for long and am still learning the features in Redis. Usually I only use it for session management.",
  "docker_desc": "Docker is a platform used to simplify the process of developing, deploying, and running applications in containers. This means that docker allows an application to run in a container or container and memory resources that are isolated from other applications. So this will facilitate the process of developing and deploying applications and is very helpful for managing applications so that all applications can run well in a particular environment.",
  "kubernetes_desc": "In addition to docker containers, it is certainly incomplete if you do not use Kubernetes. Kubernetes is an open source system used to automate the deployment, scaling, and management of applications in containers. With Kubernetes we can manage many containers automatically, so we can manage applications more easily and quickly. In addition, the feature that I like the most is auto scale or if at some point the traffic increases, it will automatically add new nodes to handle the traffic.",

  "resume_title": "Resume",
  "resume_desc": "A passionate and detail-oriented Software Engineer with a strong foundation in building scalable web and software solutions. With experience across backend, frontend, and system architecture, I thrive in translating ideas into efficient, real-world applications using modern technologies such as Rust, NodeJS, .NET, Svelte, React and Vite.",
  "resume_summary": "Summary",
  "resume_summary_desc": "I'm a Freelancer, Programmer, and Software Engineer with 4+ years of experience in web development.",
  "resume_education": "Education",
  "resume_bachelor": "Bachelor of Accounting & Finance",
  "resume_bachelor_desc": "Graduate with a strong understanding in financial accounting, auditing, and financial reporting. Active in campus organizations and small research projects on the efficiency of MSME financial systems.",
  "resume_vocation": "Vocational High School",
  "resume_vocation_desc": "Vocational High School graduate majoring in Islamic Banking with basic skills in basic accounting, good presentation, management design and entrepreneurship. Actively involved in industrial work practices, student competency competitions, or school projects.",
  "resume_profesional": "Professional Experience",
  "resume_profesional_desc1": "Create a company profile website for your company.",
  "resume_profesional_desc2": "Developed and maintained responsive web applications for various client industries using modern web technologies (HTML5, CSS3, JavaScript, and popular frameworks like React and Angular). ",
  "resume_profesional_desc3": "Collaborated closely with UI/UX designers and backend developers to deliver tailored software solutions aligned with client requirements.",
  "resume_profesional_desc4": "Integrated RESTful APIs and worked with databases ( Microsoft SQL Server) to support dynamic content.",
  "resume_profesional_desc5": "Participated in code reviews, sprint planning, and regular stand-up meetings as part of an Agile development team.",
  "resume_profesional_desc6": "Provided technical support, debugging, and post-deployment maintenance for delivered projects.",
  "resume_profesional_desc7": "Contributed to documentation and user manuals for clients and internal teams.",
  "resume_more": "More Experience",
  "resume_more_link": "See More Experience",

  "portfolio_title": "Portfolio",
  "portfolio_desc": "My journey in the world of technology has certainly found many references and cases that have helped me to further develop my expertise in the field of technology, and I do not hesitate to share my work.",

  "service_title": "Services",
  "service_backend": "I build fast, secure and scalable backend systems using technologies like Rust (Actix/Axum), NodeJS/Bun (Express/Hono) and C# (.NET/.NET Core). My focus is on API efficiency, clean code structure, solid database integration and good documentation.",
  "service_frontend": "Creating attractive and responsive user interfaces using Svelte and React. I prioritize user experience (UX) and consistent design, with the help of CSS frameworks like Bootstrap or CSS preprocessors like Sass.",
  "service_seo": "I help improve your website's visibility in search engines through optimizing HTML structure, site speed, proper use of metadata, and effective content strategies to appear on the first page of search engines.",
  "service_db": "Experience in designing, managing, and optimizing relational (PostgreSQL, SQL Server) and non-relational (MongoDB) databases. I ensure data integrity and optimal query performance.",
  "service_mentor": "Not only building or developing applications, I also provide mentoring sessions for individuals or teams who want to learn more about programming, software architecture, and best practices in system development.",
  "service_arch": "I design modular and maintainable software architectures, using approaches such as DDD, service-oriented architecture, and clean code principles. The goal: to ensure projects are scalable and easy to develop in the long term.",

  "blog_title": "Notes",
  "blog_desc": "Sometimes in my free time or when I'm bored, I make notes about the technology I'm learning. The purpose is as a documentation of what I've learned and how I understand the technology. And as a reminder in the future.",

  "testimoni_title": "Testimonials",
  "testimoni_desc": "Thank you for the feedback that has given me trust. I am very happy to be able to work with a dedicated team in creating efficient, scalable, and user-friendly digital solutions.",

  "contact_title": "Contact",
  "contact_desc": "If you have any questions or would like to discuss your project, please feel free to contact me using the contact details below.",

  "send_message": "Send Message"
}
