{
    "data": [
        {
          "title": "Snakesystem Web API",
          "category": "web-api",
          "image": "/img/portfolio/snakesystem-web-api.jpeg",
          "gallery": "portfolio-gallery-web-api",
          "description": "RESTful API untuk sistem internal Snake yang scalable dan secure. Dilengkapi dengan fitur authentikasi JWT. dan dokumentasi OpenAPI."
        },
        {
          "title": "Snakesystem Onboarding Client",
          "category": "frontend",
          "image": "/img/portfolio/snakesystem-onboarding-client.jpeg",
          "gallery": "portfolio-gallery-frontend",
          "description": "Katalog produk dengan desain responsif dan animasi interaktif."
        },
        {
          "title": "UBS Trade Dashboard",
          "category": "frontend",
          "image": "/img/portfolio/ubs-trade.jpeg",
          "gallery": "portfolio-gallery-frontend",
          "description": "Katalog produk dengan desain responsif dan animasi interaktif."
        },
        {
          "title": "S21 + Web Back Office",
          "category": "frontend",
          "image": "/img/portfolio/web-bo.jpeg",
          "gallery": "portfolio-gallery-frontend",
          "description": "Katalog produk dengan desain responsif dan animasi interaktif."
        },
        {
          "title": "S21 + Web Monitoring Bank",
          "category": "frontend",
          "image": "/img/portfolio/monitoring.jpeg",
          "gallery": "portfolio-gallery-frontend",
          "description": "Katalog produk dengan desain responsif dan animasi interaktif."
        },
        {
          "title": "Sadana Administration System",
          "category": "frontend",
          "image": "/img/portfolio/sadana.jpeg",
          "gallery": "portfolio-gallery-frontend",
          "description": "Katalog produk dengan desain responsif dan animasi interaktif."
        },
        {
          "title": "S21 + Web Company Profile",
          "category": "frontend",
          "image": "/img/portfolio/mpc-company.jpeg",
          "gallery": "portfolio-gallery-frontend",
          "description": "Katalog produk dengan desain responsif dan animasi interaktif."
        },
        {
          "title": "Opening Account",
          "category": "others", 
          "image": "/img/portfolio/pilarmas.jpeg",
          "gallery": "portfolio-gallery-others",
          "description": "Proyek branding digital untuk startup teknologi kreatif."
        },
        {
          "title": "U-Trade",
          "category": "others", 
          "image": "/img/portfolio/utrade.jpeg",
          "gallery": "portfolio-gallery-others",
          "description": "Proyek branding digital untuk startup teknologi kreatif."
        }
      ],
    "blogs": [
        {
            "title": "Actix Web x Microsoft SQL Server 🚀",
            "description": "Integrasi Actix Web dengan Microsoft SQL Server memerlukan asynchronous dengan tokio.",
            "url": "#",
            "image": "/img/blog/actix-web-mssql.png",
            "updated_at": "2023-02-22T10:00:00+07:00"
        },
        {
            "title": "CRUD Actix Web x Svelte",
            "description": "Untuk membuat Create, Read, Update dan Delete (CRUD) menggunakan Actix Web dan Svelte.",
            "url": "#",
            "image": "/img/blog/crud-actix-web-svelte.png",
            "updated_at": "2023-02-22T10:00:00+07:00"
        },
        {
            "title": "Type Data in Rust 🦀",
            "description": "Pembagian kategori type data di Rust adalah sebagai berikut.",
            "url": "#",
            "image": "/img/blog/type-data-rust.png",
            "updated_at": "2023-02-22T10:00:00+07:00"
        },
        {
            "title": "CRUD using Stored Procedure with Actix Web x Microsoft SQL Server",
            "description": "Dengan Stored Procedure kita bisa membuat Create, Read, Update dan Delete (CRUD) lebih clean.",
            "url": "#",
            "image": "/img/blog/crud-actix-web-mssql.png",
            "updated_at": "2023-02-22T10:00:00+07:00"
        },
        {
            "title": "Actix Web + JWT Authentication 🔏",
            "description": "Token biasanya akan disimpan di cookie atau local storage pada browser.",
            "url": "#",
            "image": "/img/blog/actix-web-jwt.png",
            "updated_at": "2023-02-22T10:00:00+07:00"
        },
        {
            "title": "Actix Web + Swagger OpenAPI Specification 📚",
            "description": "Dokumentasi yang baik sangat membantu dalam mempermudah dalam mempelajari integrasi ke beberapa aplikasi lain.",
            "url": "#",
            "image": "/img/blog/actix-web-swagger.png",
            "updated_at": "2023-02-22T10:00:00+07:00"
        },
        {
            "title": "Bye bye React 👋, Hello Svelte",
            "description": "Dari React ke Svelte adalah sebuah perubahan yang cukup signifikan.",
            "url": "#",
            "image": "/img/blog/actix-web-swagger.png",
            "updated_at": "2023-02-22T10:00:00+07:00"
        }
    ],
    "skills": [
        {
            "title": "Rust",
            "description": "Rust merupakan bahasa pemrograman yang saya pelajari sejak kuliah semester 6. Awalnya saya mempelajari pyhton untuk AI, kemudian saya mendapat informasi 'Katanya Rust Juga Bisa untuk AI loh...', sejak saat itu saya tertarik meskipun memang benar faktanya bahwa rust memang bahasa pemrograman paling ngeselin karena borrow checknya. Namun Rust tetap menjadi bahasa pemrograman favorit saya sampai sekarang dan lebih fokus untuk mengembangkan aplikasi backend dan web api untuk saat ini.",
            "url": "#",
            "image": "/img/skills/rust.png",
            "updated_at": "Februari 2022 - Sekarang",
            "progress": 90,
            "category": "programming"
        },
        {
            "title": "Python",
            "description": "Sebelum mengenal Rust, Python adalah bahasa pemrograman pertama yang saya pelajari. Saya kenal dengan Python bermula saat saya mengikuti program MSIB Kampus Merdeka di Orbit Future Academy dan disini juga saya pertama kali mengenal dunia IT dan Teknologi. Python pertama kali saya gunakan untuk membangun AI, ML, DL dll. Namun setelah saya bekerja saya sudah tidak pernah menggunakan python karena di tempat saya bekerja saya menggunakan bahasa pemrograman lain.",
            "url": "#",
            "image": "/img/skills/python.png",
            "updated_at": "Agustus 2021 - November 2022",
            "progress": 70,
            "category": "programming"
        },
        {
            "title": "HTML",
            "description": "HTML pertama kali saya pelajari saat saya mengikuti program MSIB Kampus Merdeka di Orbit Future Academy, HTML saya gunakan sebagai templating untuk penerapan model AI berbasis web dengan Flask. Selain sebagai templating, HTML juga saya gunakan untuk membuat web portfolio saya sendiri sebelumnya, untuk versi 1 seperti pada url berikut.",
            "url": "#",
            "image": "/img/skills/html.png",
            "updated_at": "Desember 2021 - Sekarang",
            "progress": 100,
            "category": "programming"
        },
        { 
            "title": "CSS",
            "description": "Belajar HTML rasanya kurang kalau tidak ada CSS, karena website juga perlu tampilan yang bagus dan enak untuk dilihat, karena saya ingin menyajikan sebuah website yang orang jika berkunjung maka betah. Meskipun saya sendiri masih kurang dalam menggunakan styling dengan CSS.",
            "url": "#",
            "image": "/img/skills/css.png",
            "updated_at": "Desember 2021 - Sekarang",
            "progress": 70,
            "category": "programming"
        },
        {
            "title": "Javascript",
            "description": "Awalnya saya tidak ingin belajar Javascript karena guru saya pernah memberikan saran untuk memilih satu bahasa pemrograman dulu untuk di dalamin, setelah bisa baru kamu bebas belajar apa saja Jadi saya memutuskan untuk mendalami dasar - dasar Rust terlebih dahulu. Namun ketika sudah dirasa cukup, saya mulai sedikit - sedikit belajar Javascript agar bisa membuat halaman website lebih interaktif dengan DOM.",
            "url": "#",
            "image": "/img/skills/js.png",
            "updated_at": "Maret 2021 - Sekarang",
            "progress": 90,
            "category": "programming"
        },
        {
            "title": "C#",
            "description": "Pada saat liburan semester 6, saya memutuskan untuk mencari pekerjaan supaya bisa tetap melanjutkan kuliah. Akhirnya pada awal semester 7 tepatnya di bulan November 2022 saya diterima di PT S21 Micropiranti Computer. Diperusahaan saya berkenalan dengan bahasa pemrograman C#, .NET, dan .NET Core. C# digunakan untuk membuat aplikasi backend dan web api diperusahaan. Namun C# hanya saya gunakan untuk project - project di kantor saja, untuk bahasa pemrograman yang saya gunakan dan tetap dalami adalah Rust.",
            "url": "#",
            "image": "/img/skills/cs.svg",
            "updated_at": "November 2022 - Sekarang",
            "progress": 60,
            "category": "programming"
        },


        {
            "title": "Actix Web & Tokio",
            "description": "Sebelumnya ketika saya ingin membuat web api dengan rust saya membuatnya dengan menggunakan tokio. Karena dengan tokio saya bisa membuat web api dengan asynchronous, atau multi thread. Kemudian saya mengenal actix web, dengan actix web membuat web api jadi lebih mudah karena ada fitur - fitur yang bisa saya gunakan seperti middleware, routing, error handling, dll. sehingga membuat aplikasi backend atau web api jadi lebih mudah dan cepat.",
            "url": "#",
            "image": "/img/skills/actix.png",
            "updated_at": "April 2022 - Sekarang",
            "progress": 95,
            "category": "tech-stack"
        }, 
        {
            "title": "Vite",
            "description": "Siapa yang tidak kenal dengan Vite, Vite merupakan module bundler yang cepat dan mudah digunakan. Dengan vite kita sudah di sediakan example source, kerangka kerja, configurasi js/ts, dan suport dengan framework frontend modern seperti React, Vue, Svelte, dll. Selain itu Vite juga memiliki unitesting dan hot module reloading sehingga membuat pengembangan aplikasi frontend menjadi lebih mudah.",
            "url": "#",
            "image": "/img/skills/vite.png",
            "updated_at": "September 2022 - Sekarang",
            "progress": 90,
            "category": "tech-stack"
        },
        {
            "title": "Svelte / SvelteKit",
            "description": "Selain framework untuk membuat backend application saya juga membuat membuat halaman website dengan framework frontend seperti Svelte atau SvelteKit. Alasan mengapa saya menggunakan svelte karena simpel, cepat, mudah dan bundle size yang kecil karena tidak memerlukan runtime Virtual DOM atau WebAssembly. Selain itu svelte juga menggunakan Two Way Binding sehingga tidak perlu lagi memanipulasi DOM secara manual.",
            "url": "#",
            "image": "/img/skills/svelte.png",
            "updated_at": "Januari 2023 - Sekarang",
            "progress": 90,
            "category": "tech-stack"
        },
        {
            "title": "React & NextJS",
            "description": "Sebelum svelte, react dan next adalah framework frontend favorit saya sebelumnya. Awal saya menggunakan react karena ketika ingin memanipulasi state dan DOM dengan Vanila Javascript itu hal yang memerlukan efort lebih dan diwaktu itu react merupakan framework populer dimana komunitasnya sangat besar. Mau nyari apa aja pasti ada. Namun setelah muncul react V18 keatas saya mulai kurang suka dengan react karena adanya hook dan semakin banyaknya third party library membuat saya pribadi bingung. React sekarang sudah tidak sesimpel dulu lagi dan sejak itu saya mulai menggunakan svelte.", 
            "url": "#",
            "image": "/img/skills/react.png",
            "updated_at": "Maret 2022 - Sekarang",
            "progress": 90,
            "category": "tech-stack"
        },
        {
            "title": "Bootstrap",
            "description": "Selain framework untuk interaktif frontend saya juga menggunakan bootstrap untuk membuat desain website agar lebih responsif dan mempermudah untuk memberikan style pada halaman website. Saya mulai menggunakan bootstrap ketika saya pertama kali menggunakan react. Karena dengan bootstrap saya bisa membuat suatu component dengan class dan atribut yang di berikan oleh bootatrap, sehingga saya component bisa berubah sesuai dengan tampilan yang saya inginkan.", 
            "url": "#",
            "image": "/img/skills/bootstrap.png",
            "updated_at": "Maret 2022 - Sekarang",
            "progress": 100,
            "category": "tech-stack"
        },
        {
            "title": "Sass",
            "description": "Untuk Sass bisa di bilang saya belum lama menggunakan nya, karena menggunakan sass ketika bootatrap versi 5.3.0 rilis yaitu pada 30 Mei 2023. Waktu itu saya menggunakan bootatrap karena ada kebutuhan untuk project yang banyak di pake oleh client dan bisa berubah-ubah style nya. Jadi saya melakukan kombinasi antara Sass dengan Bootatrap untuk melakukan otomatisasi pada beberapa component sehingga tidak perlu lagi membuatnya secara manual.", 
            "url": "#",
            "image": "/img/skills/sass.png",
            "updated_at": "Mei 2023 - Sekarang",
            "progress": 80,
            "category": "tech-stack"
        },
        {
            "title": ".NET Framework & .NET Core",
            "description": "Mencari environment untuk aplikasi berbasis windows, .NET merupakan pilihan tepat sebagai framework baik untuk web api, mvc, desktop, dll. .NET dan C# merupakan teknologi yang saya gunakan dan dikantor tempat saya bekerja. Dikantor saya menggunakan C# dan .NET Core untuk membuat aplikasi backend dan web api. Namun untuk project pribadi atau bahasa pemrograman sehari-hari diluar kantor saya tetap menggunakan Rust.", 
            "url": "#",
            "image": "/img/skills/dotnet.png",
            "updated_at": "November 2022 - Sekarang",
            "progress": 75,
            "category": "tech-stack"
        },
        {
            "title": "Angular JS",
            "description": "Angular JS atau Angular versi 1 adalah framework yang digunakan oleh tim dikantor sebagai framework frontend utama. Yang biasanya di kombinasikan dengan JQuery dan Gulp sebagai module bundlernya. Angular JS telah berakhir sukungan resminya oleh tim Angular sejak Januari 2022. Oleh karena itu saya sedang bertahap untuk migrasi teknologi ke Svelte karena kebiasaan tim dengan angular js yang menggunakan two way data binding dan svelte lebih sederhana dan mudah. Selain itu dari atasan dan tim juga setup untuk menggunakan svelte.", 
            "url": "#",
            "image": "/img/skills/angularjs.png",
            "updated_at": "November 2022 - Sekarang",
            "progress": 60,
            "category": "tech-stack"
        },

        {
            "title": "GIT, GitHub, Gitea",
            "description": "Bagi semua programmer, CI/CD merupakan sebuah tools untuk mengintegrasikan suatu perangkat lunak, code atau project agar dalam siklus pengembangan bisa dimaintain dengan baik. Ketika saya memulai bertpetualang didunia teknologi saya mulai menggunakan git sebagai media sosial utama seorang programmer. DImana saya bisa menyimpan dan mempublish apa yang pernah saya buat di internet. Selain itu saya juga mempelajari dan menerapkan Gitea di dalam perusahaan saya bekerja. Karena agar code project dapat dimanaged dengan baik dan efisien.",
            "url": "#",
            "image": "/img/skills/git.png",
            "updated_at": "Februari 2022 - Sekarang",
            "progress": 100,
            "category": "others"
        },
        {
            "title": "Swagger & OpenAPI",
            "description": "Seorang programmer lebih tepatnya seorang backend atau fullstack tentunya wajib membuat dokumentasi dari api yang telah dibuat. Selain itu dokumentasi ini juga sangat membantu dalam mempermudah dalam mempelajari integrasi ke beberapa aplikasi lain dengan menerapkan api specification yang telah dibuat. Sehingga jika bekerja secara tim dengan frontend, mobile, dektop dan aplikasi backend lainnya akan lebih mudah dan terstruktur. Selain itu api specification juga membantu saya pribadi dalam mengingat fitur dan fungsi pada aplikasi yang saya buat.",
            "url": "#",
            "image": "/img/skills/swagger.png",
            "updated_at": "Februari 2022 - Sekarang",
            "progress": 95,
            "category": "others"
        },
        {
            "title": "PostgreSQL",
            "description": "Membuat aplikasi backend atau api tentu tidak ketinggalan yang namanya database. PostgreSQL merupakan salah satu database favorit saya karena memiliki fitur-fitur yang sangat lengkap dan tentunya gratis. PostgreSQL adalah database yang pertamakali saya pelajari dan saya gunakan untuk membuat project pribadi. Fitur yang saya sukai dan paling sering saya gunakan di PostgreSQl adalah function dan Stored Procedure, karena dengan fitur ini penulisan code tidak terlalu panjang dan rapi selain itu logic bisnis juga ada didalam database.",
            "url": "#",
            "image": "/img/skills/postgresql.png",
            "updated_at": "Februari 2022 - Sekarang",
            "progress": 80,
            "category": "others"
        },
        {
            "title": "Microsoft SQL Server",
            "description": "Selain PostgreSQL dikantor dan project pribadi saya juga menggunakan Microsoft SQL Server. SQL Server pertamakali saya pelajari ketika saya masuk ke perusahaan saya bekerja fitur dari SQL server juga tidak kalah banyak seperti PostgreSQL. Namun untuk mengakses semua fitur dari SQL Server secara native hanya bisa mengguakan C# dan .NET atau .NET Core seperti Trigger, Migration, Tracking, SMO, Dependency Injection dll, ORM dengan Entity Framework dan Notification. Namun untuk function dan stored procedure masih bisa digunakan dengan bahasa pemrograman lain seperti Rust yang saya gunakan.",
            "url": "#",
            "image": "/img/skills/mssql.png",
            "updated_at": "Februari 2022 - Sekarang",
            "progress": 90,
            "category": "others"
        },
        {
            "title": "Mongo DB",
            "description": "Database lain yang saya gunakan adalah MongoDB. Mongodb merupakan database non-relational yang sangat populer digunakan oleh banyak developer. Fitur yang paling saya sukai pada mongodb adalah Full Text Search, Aggregation, dan Replication. fitur ini sangat membantu dalam meningkatkan performance aplikasi dalam pencarian data atau get data. Meskipun pada database lain seperti PostgreSQL dan Microsoft SQL Server juga terdapat fitur ini tetapi pada MongoDB memiliki performa yang lebih baik dan lebih cepat karena berbasis database object.",
            "url": "#",
            "image": "/img/skills/mongodb.png",
            "updated_at": "Februari 2022 - Sekarang",
            "progress": 70,
            "category": "others"
        },
        {
            "title": "Redis",
            "description": "Database lain yang saya gunakan adalah Redis. seperti yang kita tahu Redis digunakan untuk menyimpan data status sebagai cache diserver seperti data session atau data-data lain yang sering diakses oleh user. Karena redis berbasi key value dan disimpan di memory sehingga sangat cepat dan efisien. Namun saya belum lama menggunakan redis dan masih mempelajari fitur-fitur yang ada di redis. Bisasanya saya hanya menggunakannya untuk pengelolaan session saja.",
            "url": "#",
            "image": "/img/skills/redis.png",
            "updated_at": "Februari 2022 - Sekarang",
            "progress": 50,
            "category": "others"
        },
        {
            "title": "Docker",
            "description": "Docker adalah platform yang digunakan untuk mempermudah proses pengembangan, penyebaran, dan menjalankan aplikasi di dalam kontainer. Artinya docker memungkinkan suatu aplikasi jalan di dalam container atau wadah dan resource memory yang di isolasi dari aplikasi lain. Sehingga hal ini akan memudahkan proses pengembangan dan penyebaran aplikasi serta sangat membantu untuk mmemanajemen aplikasi supaya semua aplikasi bisa berjalan dengan baik di sebuah lingkungan tertentu.",
            "url": "#",
            "image": "/img/skills/docker.png",
            "updated_at": "Februari 2022 - Sekarang",
            "progress": 50,
            "category": "others"
        },
        {
            "title": "Kubernetes",
            "description": "Selain docker kontainer tentunya kuranng lengkap jika tidak menggunakan Kubernetes.Kubernetes adalah sistem open source yang digunakan untuk mengotomatiskan penerapan, penskalaan, dan pengelolaan aplikasi dalam kontainer. Dengan kubernetes kita dapat mengelola banyak kontainer secara otomatis, sehingga kita bisa mengelola aplikasi dengan lebih mudah dan cepat. Selain itu fitur yang pling saya suka adalah auto scale atau jika suatu saat trafiknya meningkat maka secara otomatis akan menambahkan node baru untuk menangani traffic tersebut.",
            "url": "#",
            "image": "/img/skills/kubernetes.png",
            "updated_at": "Februari 2022 - Sekarang",
            "progress": 40,
            "category": "others"
        }
    ],
    "testimonials": [
        {
            "name": "Budi",
            "image": "/img/testimonials/1.jpg",
            "position": "Designer",
            "company": "PT. Budi",
            "description": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Quisquam, quod.",
            "star": 5
        },
        {
            "name": "Joko",
            "image": "/img/testimonials/2.jpg",
            "position": "CEO & Founder",
            "company": "PT. Joko",
            "description": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Quisquam, quod.",
            "star": 5
        },
        {
            "name": "Elie",
            "image": "/img/testimonials/3.jpg",
            "position": "Enterpreneur",
            "company": "PT. Elie",
            "description": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Quisquam, quod.",
            "star": 5
        },
        {
            "name": "Sukron",
            "image": "/img/testimonials/4.jpg",
            "position": "CEO & Founder",
            "company": "PT. Sukron",
            "description": "Lorem ipsum dolor sit amet consectetur adipisicing elit. Quisquam, quod.",
            "star": 4
        }
    ]

}